# ClearCoverOther Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ClearCoverOther Property
ParameterTypeId Class See Also
---
"Rebar Cover - Other Faces"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ClearCoverOther { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ClearCoverOther As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ClearCoverOther {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace